/*
 * DHT11.h
 *
 *  Created on: 10 мар. 2023 г.
 *      Author: belyaev
 */

#ifndef MY_APPLICATION_DHT22_H_
#define MY_APPLICATION_DHT22_H_
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"
#include "gpio_ST.h"
#include "Delay.h"

//*******************************************************************************************
//*******************************************************************************************
#define  DHT22_PRESENCE		2	//Признак наличия датчика на шине.

//****************************************************
typedef enum {
	DHT22_STATE_RESET = 0,
	DHT22_STATE_INIT,
	DHT22_STATE_WAITING_MEAS,
	DHT22_STATE_OK,
	DHT22_STATE_PRESENCE_ERR,
	DHT22_STATE_CHECKSUM_ERR,
}Dht22_State_t;
//****************************************************
//Структура контекста для работы с DHT11.
//#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct{
	GPIO_TypeDef	*port;
	uint32_t		pin;
	Dht22_State_t	state;
	uint16_t 		humidity;
	int16_t 		temperature;
}Dht22_t;
//#pragma pack(pop)//вернули предыдущую настройку.
//*******************************************************************************************
//*******************************************************************************************
void 	 DHT22_Init(void);
void 	 DHT22_ReadData(void);
uint16_t DHT22_Temperature(void);
uint16_t DHT22_Humidity(void);
Dht22_State_t DHT22_State(void);
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
#endif /* MY_APPLICATION_DHT22_H_ */







